## 08데이터 전처리 실습-3
### 데이터 변환
#### 2020/06/16 keonwoo Park

# 데이터 변환
### 평활화, 집계, 속성구성
### 정규화
- 최소-최대 정규화
- Z-score 정규화
- 소수 척도화

### (수치형 데이터) 이산화
- 구간화
- 히스토그램
- 엔트로피-기반 이산화
- 카이제곱 결합
- 군집 분석
- 직관적 분할

### (범주형 데이터)개념 계층

In [5]:
# 정규화
import pandas as pd
import numpy as np

data = pd.read_csv("ch5-1(선박입출항).csv", encoding="CP949", index_col = "항만")

In [9]:
data.head()

       입항선박수     입항선박톤수  출항선박수     출항선박톤수
항만
부산      7301  105138280   7409  103857903
인천      2715   30716710   2716   30779186
평택.당진   1558   23153226   1536   22778109
경인항       28     126236     27     128344
동해.묵호    552    4202603    546    4039929

In [10]:
# 최소-최대 정규화
# 최소값: 0, 최대값: 1로 가정
from sklearn.preprocessing import MinMaxScaler

mms = MinMaxScaler()

In [53]:
df2 = pd.DataFrame(mms.fit_transform(data.loc[:,'입항선박수':'출항선박톤수']),
                  columns = ['입항선박수','입항선박톤수','출항선박수','출항선박톤수'])

In [55]:
 df2.head()

      입항선박수    입항선박톤수     출항선박수    출항선박톤수
0  1.000000  1.000000  1.000000  1.000000
1  0.371609  0.292150  0.366325  0.296353
2  0.213072  0.220211  0.206994  0.219314
3  0.003426  0.001193  0.003241  0.001228
4  0.075226  0.039965  0.073319  0.038891

In [56]:
# Z-scroe 정규화
from sklearn.preprocessing import StandardScaler

std = StandardScaler()

In [57]:
df2 = pd.DataFrame(std.fit_transform(data.loc[:,'입항선박수':'출항선박톤수']),
                  columns = ['입항선박수','입항선박톤수','출항선박수','출항선박톤수'])

In [58]:
df2.head()

      입항선박수    입항선박톤수     출항선박수    출항선박톤수
0  3.977058  4.326171  3.999328  4.289097
1  1.069845  0.907552  1.056042  0.912063
2  0.336386  0.560117  0.315987  0.542325
3 -0.633531 -0.497648 -0.630406 -0.504341
4 -0.301350 -0.310396 -0.304907 -0.323583

In [ ]:
# 소수 척도화  모든 값을 소수로 만드는 것(칼럼의 최대값의 자리수로 각값을 나눈다.)
# 각 항목에서 최대값 구하기
a1 = max(data.loc[:, '입항선박수'])
a2 = max(data.loc[:, '입항선박톤수'])
b1 = max(data.loc[:, '출항선박수'])
b2 = max(data.loc[:, '출항선박톤수'])

# 소수 척도화 수행
list_of_decs = []

In [98]:
data_index = list(data.index)

In [100]:
for i in data_index:
    list_of_decs.append([data.loc[i,'입항선박수'] / pow(10, len(str(a1))),
                        data.loc[i,'입항선박톤수'] / pow(10, len(str(a2))),
                        data.loc[i,'출항선박수'] / pow(10, len(str(b1))),
                        data.loc[i,'출항선박톤수'] / pow(10, len(str(b2)))])

In [102]:
df2 = pd.DataFrame(list_of_decs,
                  columns = ["입항선박수",'입항선박톤수','출항선박수','출항선박톤수'])

In [104]:
df2.head()

    입항선박수    입항선박톤수   출항선박수    출항선박톤수
0  0.7301  0.105138  0.7409  0.103858
1  0.2715  0.030717  0.2716  0.030779
2  0.1558  0.023153  0.1536  0.022778
3  0.0028  0.000126  0.0027  0.000128
4  0.0552  0.004203  0.0546  0.004040

# 이산화 - 엔트로피 기반 이산화

In [105]:
data = pd.read_csv("ch5-2(국내대학현황).csv",encoding="CP949")

In [108]:
data.head()

     학제       학교명  지역  설립  재적학생수
0  전문대학    한국철도대학  경기  국립    180
1  전문대학    강원도립대학  강원  공립   1658
2  전문대학  경남도립거창대학  경남  공립   1614
3  전문대학  경남도립남해대학  경남  공립   1639
4  전문대학   경북도립대학교  경북  공립   1389

# 엔트로피 기반으로 구간을 나누는 방법

# 재적학생수 속성을 리스트로 저장
v_재적학생수 = list(data.loc[:,'재적학생수'])